tut02/sol02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-22 Mo 11:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 2. Übungsblatt</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 2. Übungsblatt</h1>

<div id="outline-container-org8b8133b" class="outline-2">
<h2 id="org8b8133b"><span class="section-number-2">1</span> Hinweise</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Zusätzlich zu den Übungsaufgaben wurde eine <b>dritte Folie</b> gezeigt.  Diese besteht aus zwei Teilen:
<ul class="org-ul">
<li>Der <b>Rücksprungalgorithmus</b> ist im Vorlesungsmaterial auf <i>Seite 20</i> zu finden.</li>
<li>Die <b>Definition von EBNF-Termen</b> ist im Vorlesungsmaterial auf <i>Seite 21</i> zu finden.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge8de498" class="outline-2">
<h2 id="orge8de498"><span class="section-number-2">2</span> Lösung zu Aufgabe 1 (AGS 2.2.46)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org117afb2" class="outline-3">
<h3 id="org117afb2"><span class="section-number-3">2.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">caaa</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">caaa</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga71cf74" class="outline-3">
<h3 id="orga71cf74"><span class="section-number-3">2.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">aa</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">aaac</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">ab</td>
<td class="org-right">2 1</td>
</tr>

<tr>
<td class="org-left">aba</td>
<td class="org-right"><del>2</del> 1</td>
</tr>

<tr>
<td class="org-left">abac</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">abacac</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6079c5d" class="outline-3">
<h3 id="org6079c5d"><span class="section-number-3">2.3</span> Teilaufgabe c</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ε</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">ab</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">aba</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">aba</td>
<td class="org-right">2 1</td>
</tr>

<tr>
<td class="org-left">abaa</td>
<td class="org-right">1 2 1</td>
</tr>

<tr>
<td class="org-left">abaab</td>
<td class="org-right"><del>1</del> 2 1</td>
</tr>

<tr>
<td class="org-left">abaab</td>
<td class="org-right"><del>2</del> 1</td>
</tr>

<tr>
<td class="org-left">abaabc</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">abaabc</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org41d1cd9" class="outline-2">
<h2 id="org41d1cd9"><span class="section-number-2">3</span> Lösung zu Aufgabe 2 (AGS 2.2.6)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgff28741" class="outline-3">
<h3 id="orgff28741"><span class="section-number-3">3.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>siehe Tafel</i>
</p>
</div>
</div>

<div id="outline-container-orga2b643e" class="outline-3">
<h3 id="orga2b643e"><span class="section-number-3">3.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wort</th>
<th scope="col" class="org-right">Markenkeller</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">2 1</td>
</tr>

<tr>
<td class="org-left">aa</td>
<td class="org-right">1 2 1</td>
</tr>

<tr>
<td class="org-left">aaa</td>
<td class="org-right">3 1 2 1</td>
</tr>

<tr>
<td class="org-left">aaa</td>
<td class="org-right">2 3 1 2 1</td>
</tr>

<tr>
<td class="org-left">aaaaccb</td>
<td class="org-right"><del>2</del> 3 1 2 1</td>
</tr>

<tr>
<td class="org-left">aaaaccb</td>
<td class="org-right"><del>3</del> 1 2 1</td>
</tr>

<tr>
<td class="org-left">aaaaccbd</td>
<td class="org-right"><del>1</del> 2 1</td>
</tr>

<tr>
<td class="org-left">aaaaccbdb</td>
<td class="org-right"><del>2</del> 1</td>
</tr>

<tr>
<td class="org-left">aaaaccbdb</td>
<td class="org-right"><del>1</del></td>
</tr>

<tr>
<td class="org-left">aaaaccbdbb</td>
<td class="org-right">ε</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgdfc6186" class="outline-2">
<h2 id="orgdfc6186"><span class="section-number-2">4</span> Lösung zu Aufgabe 3 (AGS 2.2.4)</h2>
<div class="outline-text-2" id="text-4">
<p>
<i>siehe Tafel</i>
</p>
</div>
</div>

<div id="outline-container-org5752d15" class="outline-2">
<h2 id="org5752d15"><span class="section-number-2">5</span> Lösung zu Aufgabe 4 (AGS 2.2.10)</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>V = {A, B}</li>
<li>Σ = {a, b, c, d}</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Zeichenkette</th>
<th scope="col" class="org-left">∈ T(Σ, V)</th>
<th scope="col" class="org-left">Begründung</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(a)</td>
<td class="org-left">ja</td>
<td class="org-left">1. und 3.</td>
</tr>

<tr>
<td class="org-left">(b)</td>
<td class="org-left">ja</td>
<td class="org-left">1. und 3. und 3.</td>
</tr>

<tr>
<td class="org-left">(c)</td>
<td class="org-left">nein</td>
<td class="org-left">C ∉ V ∪ Σ ∪ M</td>
</tr>

<tr>
<td class="org-left">(d)</td>
<td class="org-left">nein</td>
<td class="org-left">∪ ∉ V ∪ Σ ∪ M</td>
</tr>

<tr>
<td class="org-left">(e)</td>
<td class="org-left">ja</td>
<td class="org-left">2. und 4. und 3.</td>
</tr>

<tr>
<td class="org-left">(f)</td>
<td class="org-left">nein</td>
<td class="org-left">4. oder 3.</td>
</tr>

<tr>
<td class="org-left">(g)</td>
<td class="org-left">nein</td>
<td class="org-left">* ∉ Σ ∪ V ∪ M</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-22</p>
<p class="date">Created: 2018-10-22 Mo 11:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
